wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
/*
 * RTC.c
 *
 *  Created on: Jan 21, 2026
 *      Author: wegi0
 */

//===================================================================================================================
#include "main.h"
#include <time.h>
#include "stdio.h"
#include "RTC.h"
#include "ADT_F.h"
#include "types_h.h"
#include "inttypes.h"
#include "stm32u5g9j_discovery_lcd.h"
#include "demos.h"
//===================================================================================================================
extern uint8_t idx[];
extern uint8_t idy[];
extern char tekst[];
extern RTC_HandleTypeDef hrtc;
extern uint16_t lcd_text_color ;
extern uint16_t lcd_background_color ;
extern TIM_HandleTypeDef htim6;
__IO  extern  int8_t pressed ;
extern uint32_t brightness;
extern void TIM6_IRQHandler(void);
extern uint32_t shifted ;





//---
RTC_TimeTypeDef my_time;
RTC_TimeTypeDef old_time;
RTC_DateTypeDef my_date;

RTC_TimeTypeDef currentTime;
RTC_DateTypeDef currentDate;
time_t timestamp;
struct tm currTime;
//---


int32_t century = 21;
int32_t SECONDS_TO_CALIBRATE = 0;
uint32_t HOURS_CALIBRATE_PERIOD = 1;
uint8_t  UPDATE_FLAG = 0;

uint8_t change_colors = 0;
uint8_t run_slideshow = 0;
uint8_t mode_night = 0;

//---
uint8_t max_day; // maximum day in month

//---


//===================================================================================================================
//	RTC_BKP_DR0 ROTATION TEST MODE - NOT USED
//
//	RTC_BKP_DR1 LIGHT VALUE 0 TO 100 brightness
//	RTC_BKP_DR2 COLOR FONTS ENABLED 0 = ENABLED  != 0 DISABLED
//	RTC_BKP_DR3 NIGHT MODE ENABLED 0 = ENABLED  != 0 DISABLED
//	RTC_BKP_DR4 HOURS of calibrate interval
//	RTC_BKP_DR5  SECONDS TO CALIBRATE
//	RTC_BKP_DR6 slideshow mode enabled/disabled
//	RTC_BKP_DR7 night light value
//	RTC_BKP_DR8 epoch LOW 32 bits
//	RTC_BKP_DR9 epoch high 32 bits
//	RTC_BKP_DR10 century
//===================================================================================================================
//===================================================================================================================
//===================================================================================================================
//===================================================================================================================
void print_RTC(void){

	check_night_mode();
	int hh = my_time.Hours, mm = my_time.Minutes, ss = my_time.Seconds;

	set_color_RTC();

	old_time.Seconds = my_time.Seconds;
	sprintf(tekst, "%02d", hh);
	shifted = 25;
	render_shiftedtext_monospace(0, 0, &tekst[0], digital_7_ttf, 230);
	sprintf(tekst, "%02d", mm);
	render_text_monospace(396, 0, &tekst[0], digital_7_ttf, 230);


	my_date.WeekDay = calc_dow((int) (((century - 1) * 100) + my_date.Year)  , (int) my_date.Month , (int) my_date.Date );

	if(ss == 0) { // update weekday field
		if(hh == 0) { // between 00:00:00 and 00:07:00
			if(mm < 8) {
				clear_week_field();
			} // END if(mm < 8)
		} // END if(hh == 0) { // between 00:00:00 and 00:07:00
	} // END if(ss == 0) { // update weekday field
	Seconds_print(ss);
	lcd_text_boxed(190, 300, getDayofweek(my_date.WeekDay), SourceCodePro_Bold_ttf, 140);


	hh = my_date.Year + ((century - 1) * 100);
	sprintf(tekst, "%04d-%02d-%02d", hh, my_date.Month, my_date.Date);
	lcd_mono_text_boxed(0, 380, &tekst[0], digital_7_ttf, 80);


}
//===================================================================================================================
void read_RTC(void){
	  __HAL_RTC_WRITEPROTECTION_DISABLE(&hrtc);
	  //HAL_RTC_WaitForSynchro(&hrtc);
	  HAL_RTC_GetTime(&hrtc, &my_time, RTC_FORMAT_BIN);
	  HAL_RTC_GetDate(&hrtc, &my_date, RTC_FORMAT_BIN);
}
//===================================================================================================================
void colon_print(void){
	TIM6->CR1 = TIM6->CR1 | 1;
	HAL_TIM_Base_Start_IT(&htim6);

	BSP_LCD_FillRect(0, 385, 80, 30, 30, lcd_text_color);
	BSP_LCD_FillRect(0, 385, 181, 30, 30, lcd_text_color);
}
//===================================================================================================================
char* getDayofweek(uint8_t number) {
	if(number == 0) { number = 1;}
	if(number  > 7) { number = 7;}
 	char *weekday[] = { "MONDAY", "TUESDAY", "WEDNESDAY","THURSDAY","FRIDAY","SATURDAY" , "SUNDAY"};
	return weekday[number-1];
}
//===================================================================================================================
int calc_dow(int y, int m,int d) {
	int result;

	y-=m<3;
	result = (y+y/4-y/100+y/400+"-bed=pen+mad."[m]+d)%7;
	if(result == 0) {result = 7;}
	return result;
}
//===================================================================================================================
void clear_week_field(void){
	BSP_LCD_FillRect(0, 190, 294, 610, 84, lcd_background_color);
}
//===================================================================================================================
void stop_colon(void) {
    HAL_TIM_Base_Stop_IT(&htim6);
    TIM6->CR1 = TIM6->CR1 & 0xfffffffe;
	BSP_LCD_FillRect(0, 385, 80, 30, 30, lcd_background_color);
	BSP_LCD_FillRect(0, 385, 181, 30, 30, lcd_background_color);
}
//===================================================================================================================
void  test_print_RTC(void) {
	int32_t tmpr1;
	uint8_t tmpr2, tmpr3;
	struct tm * czas_lokal;
	//---
	read_RTC();
	tmpr2 = my_time.Minutes;

	int ss = my_time.Seconds;
	set_color_RTC(); // TODO: add set color

	if(my_time.Seconds != old_time.Seconds) {
		old_time.Seconds = my_time.Seconds;
		if(ss == 3) {
			if(UPDATE_FLAG == 0){ compare_EPOCH(); }
		}

		//TODO ADD TIME
		if(UPDATE_FLAG == 1) {
			if(my_time.Seconds == 4) {

				UPDATE_FLAG = 0; // clear update flag
				tmpr1 = SECONDS_TO_CALIBRATE; // get for compare and calculations seconds calibrate value

//------------------
				if(tmpr1 != 0) { // exist calibration seconds value != 0 ?

					read_timestamp();
					timestamp = timestamp + tmpr1;
					czas_lokal = gmtime(&timestamp);

					my_date.Year     =  czas_lokal->tm_year % 100 ;
					my_date.Date     =  czas_lokal->tm_mday ;
					my_date.Month    =  czas_lokal->tm_mon +1 ;
					my_date.WeekDay  =  czas_lokal->tm_mday ;

