wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
					my_time.Hours    =  czas_lokal->tm_hour ;
					my_time.Minutes  =  czas_lokal->tm_min ;
					my_time.Seconds  =  czas_lokal->tm_sec ;

					set_RTC_DATE();
					HAL_RTC_SetTime(&hrtc, &my_time, RTC_FORMAT_BIN); // store setup value
					ss = my_time.Seconds;
					print_RTC(); // immediatelly RTC print
//---
				}
			}
		}

		if(my_time.Seconds == 0) {
			print_RTC();
			return;
		} // end if(my_time.Seconds == 0)


		//TODO image

		if(ss == 5) {
			if(run_slideshow == 0) {
				if(tmpr2 %5 == 0) {
					(void) BSP_LCD_SetBrightness(0,  100);
					tmpr3 = tmpr2 / 5;
					TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
					readPicFromFlash(tmpr3);
					HAL_Delay(8000);
					for(int t = 100; t > -1; t--) {
						(void) BSP_LCD_SetBrightness(0, (uint32_t) t);
						HAL_Delay(50);
					}
					LCD_ClrScr(lcd_background_color);
					(void) BSP_LCD_SetBrightness(0,  33);
					HAL_Delay(50);
					print_RTC();
					return;
				}
			}
		}


		Seconds_print(ss); // print colon and seconds
	} // end if(my_time.Seconds != old_time.Seconds)
}
//---
void Seconds_print(int ss) {
	colon_print(); // print colon for half second blink
	sprintf(tekst, "%02d", ss); // prepare seconds
	render_text_monospace(0, 295, &tekst[0], digital_7_ttf, 65); // print prepared seconds
}
//===================================================================================================================
void  test_setup(void) {
	if(pressed == 0) { return;}  // no touch pressed so good bye

	wait_for_releasseTS();

	if(clear_ss() == true) { return; } // clear seconds test
	// TODO SETUP CLOCK
	if(set_hours() == true) { return; }
	if(set_minuts() == true) { return; }
	if(set_year() == true) { return; }
	if(set_month() == true) { return; }
	if(set_day() == true) { return; }
	if(setting_globals() == true) {
		LCD_ClrScr(0);
		print_RTC();
		wait_for_releasseTS(); // wait for releasse TS
		HAL_Delay(55);
		return;
	}

	wait_for_releasseTS();
}
//===================================================================================================================
void wait_for_releasseTS(void) {
	while(1) {
		pressed = 0;
		HAL_Delay(50);
		if(pressed == 0) { break;}
	}
}
//===================================================================================================================
bool clear_ss(void) {
	if(possition_x < 170) {
		if(possition_y > 290) {
			if(possition_y < 380) {
				read_RTC();
				my_time.Seconds = 0;
				HAL_RTC_SetTime(&hrtc, &my_time, RTC_FORMAT_BIN);
				print_RTC();
				wait_for_releasseTS(); // wait for releasse TS
				return true;
			}
		}
	}
	return false;
}
//===================================================================================================================
void LCD_ClrScr(uint16_t color) {
	uint16_t* pFBaddr = (uint16_t *) LTDC_Layer1->CFBAR;
	for(uint32_t i = 0; i < (800*480) ; i++) { pFBaddr[i] = color; }
}
//===================================================================================================================
bool set_hours(void) {
	uint8_t action, bckp, chk_hrs;
	read_RTC();
	chk_hrs = my_time.Hours;
  if((test_pressed_point(0, 390, 0, 290)) == true) {

		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
		LCD_ClrScr(lcd_background_color);
		while(1){
			lcd_text_color = 0xffff;
			lcd_text_boxed(100, 0, "SET HOURS" , SourceCodePro_Bold_ttf, 140);
			put_number( my_time.Hours);
			action = test_action();
			if((action == 3)) { // DONE pressed
				bckp = my_time.Hours;
				read_RTC();
				my_time.Hours = bckp;
				if(chk_hrs != my_time.Hours) {
					HAL_RTC_SetTime(&hrtc, &my_time, RTC_FORMAT_BIN); // store setup value
				}
				LCD_ClrScr(lcd_background_color);
				print_RTC();
				wait_for_releasseTS();
				return true;
			} else {
				if(action == 2) { // PLUS pressed
					if(my_time.Hours == 23) { my_time.Hours = 0;} else { my_time.Hours++;}
				} else { // MINUS pressed
					if(my_time.Hours == 0) { my_time.Hours = 23;} else { my_time.Hours--;}
				}
			}

		}

	}
	return false;
}
//===================================================================================================================
bool test_pressed_point(uint16_t xmin, uint16_t xmax, uint16_t ymin, uint16_t ymax){
	if(possition_x > xmin) {
		if(possition_x < xmax){
			if(possition_y >= ymin){
				if(possition_y < ymax){
					return true;
				}
			}
		}
	}
	return false;
}
//===================================================================================================================
void put_number(uint8_t data){
	put_DATE_number();
	sprintf(tekst, "%02d", data);
	lcd_mono_text_boxed(200, 100, tekst, digital_7_ttf, 220);
}
//===================================================================================================================
uint8_t test_action(void) {
	while(1) {

		if(pressed != 0) {
			HAL_Delay(100);
			pressed = 0;
			// DONE test
			if((test_pressed_point(210, 590, 390, 479)) == true) { return 3;} // DONE
			if((test_pressed_point(600, 799, 100, 390)) == true) { return 2;} // PLUS
			if((test_pressed_point(0, 200, 100, 389)) == true) { return 1;}  // MINUS
		}
	}
}
//===================================================================================================================
bool set_minuts(void) {

	uint8_t action , bckp, chk_min;
	read_RTC();
	chk_min = my_time.Minutes;
	if((test_pressed_point(400, 799, 0, 290)) == true) {
		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
		LCD_ClrScr(lcd_background_color);
		while(1){
			lcd_text_color = 0xffff;
			lcd_text_boxed(80, 0, "SET MINUTS", SourceCodePro_Bold_ttf, 140);
			put_number( my_time.Minutes);
			action = test_action();
			if((action == 3)) { // DONE pressed
				bckp = my_time.Minutes;
				read_RTC();
				my_time.Minutes = bckp;

				if(chk_min != my_time.Minutes) {

					my_time.Seconds ++;
					if(my_time.Seconds > 59) { my_time.Seconds = 0;}
					__HAL_RTC_WRITEPROTECTION_DISABLE(&hrtc);
					//HAL_RTC_WaitForSynchro(&hrtc);
					HAL_RTC_SetTime(&hrtc, &my_time, RTC_FORMAT_BIN); // store setup value
				}

