wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
				LCD_ClrScr(lcd_background_color);
				print_RTC();
				wait_for_releasseTS();
				return true;
			} else {
				if(action == 2) { // PLUS pressed
					if(my_time.Minutes == 59) { my_time.Minutes = 0;} else { my_time.Minutes++;}
				} else { // MINUS pressed
					if(my_time.Minutes == 0) { my_time.Minutes = 59;} else { my_time.Minutes--;}
				}
			}

		}

	}
	return false; // doesn't choose set hours
}
//===================================================================================================================
bool set_year(void) {
	uint8_t action;
	if((test_pressed_point(0, 280, 380, 479)) == true)  {
		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
		LCD_ClrScr(lcd_background_color);
		while(1){
			lcd_text_color = 0xffff;
			lcd_text_boxed(120, 0, "SET YEAR", SourceCodePro_Bold_ttf, 140);
			sprintf(tekst, "%04d", (int) (my_date.Year + ((century - 1) * 100)));
			lcd_mono_text_boxed(250, 190, tekst, digital_7_ttf, 80);
			put_DATE_number();
			action = test_action();
			check_RTC_DATE();
			if((action == 3)) { // DONE pressed
				set_RTC_DATE();
				LCD_ClrScr(lcd_background_color);
				print_RTC();
				wait_for_releasseTS();
				return true;
			} else {
				if(action == 2) { // PLUS pressed
					if(my_date.Year == 99) { my_date.Year = 0;} else { my_date.Year++;}
				} else { // MINUS pressed
					if(my_date.Year == 0) { my_date.Year = 99;} else { my_date.Year--;}
				}
			}

		}

	}
	return false; // doesn't choose set year
}
//===================================================================================================================
void set_RTC_DATE(void){
	check_RTC_DATE();
	HAL_RTC_SetDate(&hrtc, &my_date, RTC_FORMAT_BIN);
}
void check_RTC_DATE(void){
	static const uint8_t month_maxdays[12] = {31,28,31,30,31,30,31,31,30,31,30,31} ;
	uint8_t luty_add = 0;

	if(my_date.Year > 99) { my_date.Year = my_date.Year % 100;}
	if((my_date.Year %4) == 0) {luty_add =1;}
	if(my_date.Month == 0) {my_date.Month =1;}
	if(my_date.Month > 12) {my_date.Month =12;}
	max_day = month_maxdays[my_date.Month - 1];
	if(my_date.Month == 2) { max_day = max_day + luty_add;}
	if(my_date.Date == 0 ) {my_date.Date = 1;}
	if(my_date.Date > max_day) {my_date.Date = max_day;}
	my_date.WeekDay = calc_dow((int) (((century - 1) * 100) + my_date.Year)  , (int) my_date.Month , (int) my_date.Date );


}
//===================================================================================================================
void put_DATE_number(void){
    lcd_text_color = 0xffff;
	lcd_mono_text_boxed(565, 100, "+", digital_7_ttf, 230);
	shifted = 35;
	render_shiftedtext_monospace(0, 100, "-", digital_7_ttf, 230);
	lcd_text_boxed(300, 400, "DONE", SourceCodePro_Bold_ttf, 120);

	UTIL_LCD_DrawRect(200, 100, 400, 290, 0xffffff);  // number rect
	UTIL_LCD_DrawRect(0,   100, 190, 290, 0xffffff);  // MINUS rect
	UTIL_LCD_DrawRect(605, 100, 190, 290, 0xffffff);  // PLUS rect
	UTIL_LCD_DrawRect(200, 390, 400,  89, 0xffffff);  // DONE rect
}
//===================================================================================================================
bool set_month(void) {
	uint8_t action;
	if((test_pressed_point(290, 500, 380, 479)) == true)  {
		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
		LCD_ClrScr(lcd_background_color);
		while(1){
			lcd_text_color = 0xffff;
			lcd_text_boxed(100, 0, "SET MONTH", SourceCodePro_Bold_ttf, 140);
			sprintf(tekst, "%02d", (my_date.Month));
			lcd_mono_text_boxed(320, 190, tekst, digital_7_ttf, 80);

			put_DATE_number();
			action = test_action();
			check_RTC_DATE();
			if((action == 3)) { // DONE pressed
				set_RTC_DATE();
				LCD_ClrScr(lcd_background_color);
				print_RTC();
				wait_for_releasseTS();
				return true;
			} else {
				if(action == 2) { // PLUS pressed
					if(my_date.Month == 12) { my_date.Month = 1;} else { my_date.Month++;}
				} else { // MINUS pressed
					if(my_date.Month == 1) { my_date.Month = 12;} else { my_date.Month--;}
				}
			}

		}

	}
	return false; // doesn't choose set year
}
//===================================================================================================================
bool set_day(void) {
	uint8_t action;
		if((test_pressed_point(520, 799, 380, 479)) == true)  {
		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
		LCD_ClrScr(lcd_background_color);
		check_RTC_DATE(); // get max day in month
		while(1){
			lcd_text_color = 0xffff;
			lcd_text_boxed(160, 0, "SET DAY", SourceCodePro_Bold_ttf, 140);
			sprintf(tekst, "%02d", (my_date.Date));
			lcd_mono_text_boxed(320, 190, tekst, digital_7_ttf, 80);
			put_DATE_number();
			action = test_action();
			check_RTC_DATE();
			if((action == 3)) { // DONE pressed
				set_RTC_DATE();
				LCD_ClrScr(lcd_background_color);
				print_RTC();
				wait_for_releasseTS();
				return true;
			} else {
				if(action == 2) { // PLUS pressed
					if(my_date.Date == max_day) { my_date.Date = 1;} else { my_date.Date++;}
				} else { // MINUS pressed
					if(my_date.Date == 1) { my_date.Date = max_day;} else { my_date.Date--;}
				}
			}
		}
	}
	return false; // doesn't choose set year
}
//===================================================================================================================
void READ_CENTURY(void) {
	century = (int32_t) HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR10);
	if(century > 99) {
		century = 21;
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR10,  (uint32_t) century);
	}
	if(century < -99) {
		century = 21;
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR10,  (uint32_t) century);
	}
}
//===================================================================================================================
void compare_EPOCH() {
	uint64_t tmpr01;
	time_t pgm_timestamp;
	double elapsed;
	uint32_t hours, tmpr1, tmpr_hi, tmpr_lo;

	tmpr01 = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR9); // read high 32 bits
	tmpr01 = tmpr01 << 32;
	tmpr01 = tmpr01 |  HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR8); // add low 32 bits

	pgm_timestamp = (time_t) tmpr01;
	read_timestamp(); // read RTC to timestamp
	elapsed = difftime(timestamp, pgm_timestamp); // = TIMESTAMP - PGM_TIMESTAMP

	// ELAPSED = ACTUAL TIME - PGM_TIMESTAMP
	if(elapsed > 0) {
		UPDATE_FLAG = 1;
		hours = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4); // iterval hours calibrate event

