wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
		tmpr1 = hours * 3600;


		timestamp = pgm_timestamp;
		timestamp = timestamp + tmpr1;

		tmpr_hi = (uint32_t) (timestamp >> 32);
		tmpr_lo = (uint32_t) (timestamp & 0xFFFFFFFF);

		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR8,  tmpr_lo);  // LO timestamp
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR9, tmpr_hi);  // HI timestamp

	}
}

//=====================================================================================================================
void set_EPOCH(void) { // setting the EPOCH date to calibrate seconds date
	uint32_t hours, tmpr1, tmpr_hi, tmpr_lo;

	hours = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4); // iterval hours calibrate event

	tmpr1 = hours * 3600;

	read_timestamp(); // read RTC to timestamp

	timestamp = timestamp + tmpr1;

	tmpr_hi = (uint32_t) (timestamp >> 32);
	tmpr_lo = (uint32_t) (timestamp & 0xFFFFFFFF);

	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR8,  tmpr_lo);  // LO timestamp
	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR9, tmpr_hi);  // HI timestamp

	UPDATE_FLAG = 0;
}
//=====================================================================================================================
void read_timestamp(void) {
	HAL_RTC_GetTime(&hrtc, &currentTime, RTC_FORMAT_BIN);
	HAL_RTC_GetDate(&hrtc, &currentDate, RTC_FORMAT_BIN);

	currTime.tm_year = currentDate.Year + ((century -20) * 100);  // In fact: 2000 + 18 - 1900
	currTime.tm_mday = currentDate.Date;
	currTime.tm_mon  = currentDate.Month - 1;

	currTime.tm_hour = currentTime.Hours;
	currTime.tm_min  = currentTime.Minutes;
	currTime.tm_sec  = currentTime.Seconds;

	timestamp = mktime(&currTime);
}

//===================================================================================================================
void CHECK_CALIBRATE_TIME_VALUES(void){
	uint32_t hours ;
	int32_t  seconds;
	hours = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4); // iterval hours calibrate event
	seconds = (int32_t) HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR5); // seconds to add calibrate

	if(hours == 0)      { hours   = 1;   }
	if(hours > 744)     { hours   = 744; }
	if(seconds > 99)    { seconds = 0;   } // seconds to calibrate
	if(seconds < (-99)) { seconds = 0;   } // seconds to calibrate

	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR5, (uint32_t) seconds);
	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, hours);
	HOURS_CALIBRATE_PERIOD = hours;
	SECONDS_TO_CALIBRATE   = seconds;
}
//===================================================================================================================
void set_color_RTC(void)
{
  lcd_text_color =  0xffff ;
  lcd_background_color = 0x0000;

  if ((change_colors & 0x01)!= 0) { return;}

  if(my_time.Minutes < 15) {
	  lcd_text_color = LCD_COLOR565_GREEN;
	  return;
  }
  if(my_time.Minutes < 30) {
	  lcd_text_color = LCD_COLOR565_RED;
	  return;
  }
  if(my_time.Minutes < 45) {
	  lcd_text_color = LCD_COLOR565_MAGENTA;
	  return;
  }
}
//===================================================================================================================
void SET_CENTURY(void) {

	uint8_t action ;
	read_RTC();
	READ_CENTURY();

	if((test_pressed_point(400, 800, 360, 480)) != true)  { return;}
	wait_for_releasseTS();
	HAL_Delay(100);

	TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
	LCD_ClrScr(lcd_background_color);
	lcd_text_boxed(40, 0, "SET CENTURY", SourceCodePro_Bold_ttf, 140);
	put_DATE_number();
	while(1){
		//===================================================================================================
		sprintf(tekst, "%d", (int) century);
		lcd_text_color = 0;
		lcd_mono_text_boxed(300, 190, "000", digital_7_ttf, 80);
		lcd_text_color = 0xffff;
		lcd_mono_text_boxed(300, 190, tekst, digital_7_ttf, 80);
		//===================================================================================================
		check_RTC_DATE();
		action = test_action();
		if((action == 3)) { // DONE pressed

			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR10,  (uint32_t) century);
			read_RTC();
			set_RTC_DATE();
			LCD_ClrScr(lcd_background_color);
			wait_for_releasseTS();
			HAL_Delay(100);
			clr_pressed();
			return ;
		} else {
			if(action == 2) { // PLUS pressed
				if(century == 99) { century = -99;} else { century++;}
			} else { // MINUS pressed
				if(century == -99) { century = 99;} else { century--;}
			}
		}
	}

}

//===================================================================================================================
void paint_test(void) {
	if((test_pressed_point(0, 400, 96, 192)) != true)  {
		return;
	}
	wait_for_releasseTS();
	HAL_Delay(111);
	Touchscreen_demo();
	wait_for_releasseTS();
	LCD_ClrScr(lcd_background_color);
	clr_pressed();
}
//===================================================================================================================
extern void TTF_test(void) {
	if((test_pressed_point(400, 800, 96, 192)) != true)  {
		return;
	}
	Big_TTF_Demo();
	wait_for_releasseTS();
	LCD_ClrScr(lcd_background_color);
	clr_pressed();
}
//===================================================================================================================
extern void V_BALL(void) {
	if((test_pressed_point(400, 800, 120, 240)) != true)  {
		return;
	}
	wait_for_releasseTS();
	HAL_Delay(111);
	extern void main_app(void);
	main_app();
	wait_for_releasseTS();
	HAL_Delay(111);
	LCD_ClrScr(lcd_background_color);
	clr_pressed();
}
//===================================================================================================================
void set_LIGHT(void) {

	if((test_pressed_point(0, 400, 192, 288)) != true)  {
		return;
	}

		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
		LCD_ClrScr(lcd_background_color);
		lcd_text_boxed(120, 0, "SET LIGHT", SourceCodePro_Bold_ttf, 140);
		lcd_text_boxed(300, 400, "DONE", SourceCodePro_Bold_ttf, 120);
		UTIL_LCD_DrawRect(200, 390, 400,  89, 0xffffff);  // DONE rect
		UTIL_LCD_DrawRect(0, 185, 800,  115, 0xffffff);  // slider
		wait_for_releasseTS();
		brightness = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1);
		possition_x = brightness << 3;
		possition_y = 200; // set first time pressed values
		pressed = 1;

		while(1) {
			if(pressed != 0) {
				pressed = 0;
				if((test_pressed_point(210, 590, 390, 479)) == true) { // done pressed
					HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, brightness);
					wait_for_releasseTS();
					HAL_Delay(111);
					LCD_ClrScr(lcd_background_color);
					clr_pressed();
					return ;
				} // DONE
				if(test_pressed_point(0, 800, 185, 300) == true) {
					brightness = (possition_x >> 3) ; // x / 8
					if(brightness >= 100) { brightness = 99;}
					if(brightness < 2){ brightness = 2;}
					(void) BSP_LCD_SetBrightness(0, brightness);
					(void) BSP_LCD_GetBrightness(0,&brightness);

