wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
					uint32_t lendraw = (brightness << 3) ;


					BSP_LCD_FillRect(0, 4, 190, lendraw,  105, LCD_COLOR565_GREEN);
					BSP_LCD_FillRect(0, 4+lendraw, 190, 795-lendraw,  105, 0);
					sprintf(tekst, "%03d%%", (int) brightness);

					lcd_render_just_text(250, 190, tekst, digital_7_ttf, 80,0,0);

					pressed = 0;
					HAL_Delay(10);
				}
			}
		}

}
//===================================================================================================================
void night_mode(void) {

	uint8_t action ;
	uint32_t n_mode;



	if((test_pressed_point(0, 400, 288, 384)) != true)  {
		return;
	}
	TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
	LCD_ClrScr(lcd_background_color);

	lcd_text_boxed(80, 0, "NIGHT MODE", SourceCodePro_Bold_ttf, 140);
	put_DATE_number();
	n_mode = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR3);

	while(1){
//===================================================================================================

		n_mode = n_mode &0x01;

		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR3, n_mode);

		lcd_text_color = 0;
		lcd_mono_text_boxed(300, 190, "000", digital_7_ttf, 80);
		lcd_text_color = 0xffff;


		if(n_mode  != 0) {
			sprintf(tekst, "NO!");
			brightness = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1);
		} else {
			sprintf(tekst , "YES" );
			brightness = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR7);
		}

		if(brightness <2) {brightness = 2;}
		if(brightness > 100 ){brightness = 100;}
		(void) BSP_LCD_SetBrightness(0, brightness);

		lcd_mono_text_boxed(300, 190, tekst, digital_7_ttf, 80);
		if(n_mode  == 0) {
			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR7, brightness);
		}
//===================================================================================================
		check_RTC_DATE();
		action = test_action();
		if((action == 3)) { // DONE pressed
			read_RTC();
			n_mode = n_mode &0x01;
			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR3, n_mode);
			mode_night = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR3); // read back data from backup register to variable

			wait_for_releasseTS(); // wait for releasse TS
			LCD_ClrScr(lcd_background_color);
			if(mode_night == 0) {night_light();}
			check_night_mode();
			clr_pressed();
			return ;
		} else {
			wait_for_releasseTS(); // wait for releasse TS
			if(action == 2) { // PLUS pressed
				n_mode++;
			} else { // MINUS pressed
				n_mode--;
			}
		}
	}
}

//===================================================================================================================
void set_PWM(void) {

	uint32_t light_val = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1);

	if(light_val > 100) { light_val = 100;}
	if(light_val < 2)  { light_val = 2; }
	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, light_val);
	brightness = light_val;
	(void) BSP_LCD_SetBrightness(0, light_val);
}
//---
void set_night_PWM(void) {

	uint32_t light_val = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR7);
	if(light_val > 100) { light_val = 100;}
	if(light_val < 2)  { light_val = 2; }
	HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR7, light_val);
	brightness = light_val;
	(void) BSP_LCD_SetBrightness(0, light_val);
}
//===================================================================================================================
void check_night_mode(void) {

#define nigh_value 20

	int hh;
	read_RTC();
	hh = my_time.Hours;

	if((mode_night &1) == 0) {
		if(hh < 6)  {
			set_night_PWM();
			return;
		}
		if(hh > (nigh_value-1)) {
			set_night_PWM();
			return;
		}

	}
	set_PWM(); // out of night mode turn on the light as day mode

}
//===================================================================================================================
void night_light(void){
	pressed = 1;
	TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
	LCD_ClrScr(lcd_background_color);
	lcd_text_boxed(120, 0, "SET NIGHT", SourceCodePro_Bold_ttf, 140);
	lcd_text_boxed(300, 400, "DONE", SourceCodePro_Bold_ttf, 120);
	UTIL_LCD_DrawRect(200, 390, 400,  89, 0xffffff);  // DONE rect
	UTIL_LCD_DrawRect(0, 185, 800,  115, 0xffffff);  // slider
	wait_for_releasseTS();
	possition_x = brightness << 3;
	possition_y = 200; // set first time pressed values
	pressed = 1;

	while(1) {
		if(pressed != 0) {
			pressed = 0;
			if((test_pressed_point(210, 590, 390, 479)) == true) { // done pressed
				HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR7, brightness);
				wait_for_releasseTS();
				HAL_Delay(111);
				LCD_ClrScr(lcd_background_color);
				return ;
			} // DONE
			if(test_pressed_point(0, 800, 185, 300) == true) {
				brightness = (possition_x >> 3) ; // x / 8
				if(brightness >= 100) { brightness = 99;}
				if(brightness < 2){ brightness = 2;}
				(void) BSP_LCD_SetBrightness(0, brightness);
				(void) BSP_LCD_GetBrightness(0,&brightness);

				uint32_t lendraw = (brightness << 3) ;


				BSP_LCD_FillRect(0, 4, 190, lendraw,  105, LCD_COLOR_RGB565_RED);
				BSP_LCD_FillRect(0, 4+lendraw, 190, 795-lendraw,  105, 0);
				sprintf(tekst, "%03d%%", (int) brightness);

				lcd_render_just_text(250, 190, tekst, digital_7_ttf, 80,0,0);

				pressed = 0;
				HAL_Delay(10);
			}
		}
	}
}
//===================================================================================================================
uint8_t calibr_action(void) {
	while(1) {

		HAL_Delay(200);
		// DONE test
		if((test_pressed_point(200, 600, 250, 330)) == true) { return 5;} // DONE

		if((test_pressed_point(1, 195, 100, 250)) == true) { return 1;} // minus sec
		if((test_pressed_point(1, 195, 330, 480)) == true) { return 3;} // minus hrs

		if((test_pressed_point(605, 800, 100, 250)) == true) { return 2;} // plus sec
		if((test_pressed_point(605, 800, 330, 480)) == true) { return 4;} // plus hrs

	}
}
//===================================================================================================================
void sec_calibrate_print(void) {
	lcd_text_color = lcd_background_color;
	lcd_mono_text_boxed(350, 120, "000", digital_7_ttf, 80); // clear field by spaces
	lcd_text_color = 0xFFFF;
	sprintf(tekst, "%d", ((int)SECONDS_TO_CALIBRATE));
	if(SECONDS_TO_CALIBRATE < 0) {
		lcd_mono_text_boxed(350, 120, tekst, digital_7_ttf, 80); // print seconds
	} else {
		lcd_mono_text_boxed(410, 120, tekst, digital_7_ttf, 80); // print seconds
	}
}
//===================================================================================================================
void hrs_calibrate_print(void) {
	lcd_text_color = lcd_background_color;
	lcd_mono_text_boxed(350, 350,"000", digital_7_ttf, 80); // clear field by spaces
	lcd_text_color = 0xFFFF;
	sprintf(tekst, "%d", ((int)HOURS_CALIBRATE_PERIOD));
	if(HOURS_CALIBRATE_PERIOD > 99) {
		lcd_mono_text_boxed(350, 350, tekst, digital_7_ttf, 80); // print hours
	} else {
		lcd_mono_text_boxed(410, 350, tekst, digital_7_ttf, 80); // print hours
	}
}
//===================================================================================================================
void TIM_CALIBRATE_SETUP(void) {
	uint8_t action ;
	if((test_pressed_point(400, 800, 288, 384)) != true)  {
		return;
	}
	TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
	//==============
	//= MENU PRINT =
	//==============
	LCD_ClrScr(lcd_background_color);
	lcd_text_color = 0xffff;
	lcd_mono_text_boxed(55, 0, "SET TIM CALIBR", SourceCodePro_Bold_ttf, 100);
	lcd_mono_text_boxed(200, 150, "sec", SourceCodePro_Bold_ttf, 80);
	lcd_mono_text_boxed(200, 380, "hrs", SourceCodePro_Bold_ttf, 80);
	lcd_mono_text_boxed(30, 100, "-", digital_7_ttf, 120);
	UTIL_LCD_DrawRect(0, 100, 195,  150, 0xffffff);  // MINUS SEC rect
	lcd_mono_text_boxed(30, 330, "-", digital_7_ttf, 120);
	UTIL_LCD_DrawRect(0, 330, 195,  150, 0xffffff);  // MINUS HRS rect
	lcd_mono_text_boxed(630, 100, "+", digital_7_ttf, 120);
	UTIL_LCD_DrawRect(605, 100, 195,  150, 0xffffff);  // PLUS SEC rect
	lcd_mono_text_boxed(630, 330, "+", digital_7_ttf, 120);
	UTIL_LCD_DrawRect(605, 330, 195,  150, 0xffffff);  // PLUS SEC rect
	lcd_text_boxed(320, 260, "DONE", SourceCodePro_Bold_ttf, 100);
	UTIL_LCD_DrawRect(200, 250, 400,  80, 0xffffff);  // DONE rect
	//============================================

