wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
	sec_calibrate_print();
	hrs_calibrate_print();
	wait_for_releasseTS();

	while(1){
		pressed = 0;
		possition_x = 0;
		possition_y = 0;

		action = calibr_action();
		HAL_Delay(50);

		if(action == 5) {
			wait_for_releasseTS(); // wait for releasse TS
			LCD_ClrScr(lcd_background_color);
			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, HOURS_CALIBRATE_PERIOD);
			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR5, (uint32_t) SECONDS_TO_CALIBRATE);
			set_EPOCH();
			clr_pressed();
			return ;
		}
		if(action == 2) { // PLUS sec pressed
			if(SECONDS_TO_CALIBRATE < 99)  { SECONDS_TO_CALIBRATE++;} else { SECONDS_TO_CALIBRATE = -99;}
		}
		if (action == 1) { // MINUS sec pressed
			if(SECONDS_TO_CALIBRATE > -99)  { SECONDS_TO_CALIBRATE--;} else { SECONDS_TO_CALIBRATE = 99;}
		}
		if(action == 4) { // PLUS hrs pressed
			if(HOURS_CALIBRATE_PERIOD < 744)  { HOURS_CALIBRATE_PERIOD++;} else { HOURS_CALIBRATE_PERIOD = 1 ;}
		}
		if(action == 3) { // PLUS hrs pressed
			if(HOURS_CALIBRATE_PERIOD > 1)  { HOURS_CALIBRATE_PERIOD--;} else { HOURS_CALIBRATE_PERIOD = 744 ;}
		}

		if(action < 3) { // print seconds update
			sec_calibrate_print();

		} else {
			hrs_calibrate_print();
		}


	} // end while(1)
}
//===================================================================================================================
void COLOR_FONTS(void) {
	uint8_t action;
	uint32_t font_VAL = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR2);
	if((test_pressed_point(400, 800, 192, 288)) != true)  {
		return;
	}

	TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
	LCD_ClrScr(lcd_background_color);
	lcd_text_color = 0xffff;
	lcd_text_boxed(40, 0, "COLOR FONTS", SourceCodePro_Bold_ttf, 140);
	put_DATE_number();

	while(1){
		font_VAL = font_VAL &0x01;
		lcd_text_color = 0;
		lcd_mono_text_boxed(300, 190, "000", digital_7_ttf, 80);
		lcd_text_color = 0xffff;

		if(font_VAL  != 0) { sprintf(tekst, "NO!"); } else { sprintf(tekst , "YES" ); }
		lcd_mono_text_boxed(300, 190, tekst, digital_7_ttf, 80);

		wait_for_releasseTS();
		action = test_action();
		if((action == 3)) { // DONE pressed
			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR2, font_VAL);
			change_colors = HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR2);
			wait_for_releasseTS(); // wait for releasse TS
			LCD_ClrScr(lcd_background_color);
			HAL_Delay(100);
			clr_pressed();
			return ;
		} else {
			if(action == 2) { // PLUS pressed
				font_VAL++;
			} else { // MINUS pressed
				font_VAL--;
			}
		}

	}
}
//===================================================================================================================
void check_slideshow() {
	run_slideshow = (uint8_t) (HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR6) & 0x01 );
}
//===================================================================================================================
extern void slideshow_disable(void) {
	uint8_t s_mode, action;
	if((test_pressed_point(400, 800, 240, 360)) != true)  { return;}

	lcd_text_color = 0xffff;
	TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
	LCD_ClrScr(lcd_background_color);
	check_slideshow(); // read slide setup
	s_mode = run_slideshow;
	lcd_text_boxed(80, 0, "SLIDE MODE", SourceCodePro_Bold_ttf, 140);

	put_DATE_number();
	wait_for_releasseTS();
	HAL_Delay(100);

	while(1){
		s_mode = s_mode &0x01;
		if(s_mode  != 0) { sprintf(tekst, "NO!"); } else { sprintf(tekst , "YES" ); }
		lcd_mono_text_boxed(300, 190, tekst, digital_7_ttf, 80);

		wait_for_releasseTS();
		action = test_action();
		if((action == 3)) { // DONE pressed
			HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR6, s_mode);
			check_slideshow();
			wait_for_releasseTS(); // wait for releasse TS
			LCD_ClrScr(lcd_background_color);
			HAL_Delay(100);
			clr_pressed();
			return ;
		} else {
			if(action == 2) { // PLUS pressed
				s_mode++;
			} else { // MINUS pressed
				s_mode--;
			}
		}
	}
}
//===================================================================================================================
bool go_to_back(void) {
	if((test_pressed_point(0, 400, 384, 480)) == true)  {
		wait_for_releasseTS(); // wait for releasse TS
		LCD_ClrScr(lcd_background_color);
		HAL_Delay(100);
		return true;
	}
	return false; // doesn't choose set year
}
//===================================================================================================================
void test_page(void) {
	if((test_pressed_point(400, 800, 384, 480)) == true)  {
		wait_for_releasseTS(); // wait for releasse TS
		LCD_ClrScr(lcd_background_color);

		next_page();

		wait_for_releasseTS(); // wait for releasse TS
		LCD_ClrScr(lcd_background_color);
		clr_pressed();
	}
}
//===================================================================================================================
bool setting_globals(void){
	if((test_pressed_point(170, 800, 290, 380)) != true)  {  // was pressed SETTING GLOBALS menu?
		return false;
	}
	LCD_ClrScr(lcd_background_color);

	while(1){
		(void) BSP_LCD_SetBrightness(0, 100);
		lcd_text_color = 0XFFFF;
		lcd_background_color = 0;
		TIM6_IRQHandler(); // disable timer6 and IRQ from TIM6
//---
		lcd_text_boxed(25, 10, "GLOBAL FUNCTIONS", SourceCodePro_Bold_ttf, 100);
//---
		lcd_text_boxed(90, 116, "PAINT", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(470, 116, "BIGTTF", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(90, 212, "LIGHT", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(470, 212, "COLORS", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(111, 308, "AUTO", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(470, 308, "CALIBR", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(110, 404, "EXIT", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(510, 404, "NEXT", SourceCodePro_Bold_ttf, 100);
//---
		UTIL_LCD_DrawVLine(400, 96, 384, 0xffffff); // set partial menu draw

		UTIL_LCD_DrawRect(0, 96, 800,  384, 0xffffff);  // draw full frame of menu

		UTIL_LCD_DrawHLine(0, 192, 800, 0xffffff); // 1st 2 pos of menu
		UTIL_LCD_DrawHLine(0, 288, 800, 0xffffff); // 2nd 2 pos of menu
		UTIL_LCD_DrawHLine(0, 384, 800, 0xffffff); // 3rd 2 pos of menu

		wait_for_releasseTS();
		HAL_Delay(250);
		pressed = 0;
		while(pressed == 0) { asm volatile("NOP");}

