wegi1/STM32U5G9J-DK2-RTC/USER/RTC.c
		if( go_to_back() == true) { return true;}
		paint_test();
		TTF_test();
		set_LIGHT();
		COLOR_FONTS();
		night_mode();
		TIM_CALIBRATE_SETUP();
		test_page();
	}
}
//===================================================================================================================
void next_page(void) {
	LCD_ClrScr(lcd_background_color);

	while(1){
		(void) BSP_LCD_SetBrightness(0, 100);
		lcd_text_color = 0XFFFF;
		lcd_background_color = 0;
//---
		lcd_text_boxed(50, 25, "OTHER FUNCTIONS", SourceCodePro_Bold_ttf, 100);
//---
		lcd_text_boxed(90, 154, "DEMOS", SourceCodePro_Bold_ttf, 100);
		lcd_mono_text_boxed(450, 140, "V_BALL", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(70, 274, "SLIDES", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(510, 274, "PICS", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(110, 394, "EXIT", SourceCodePro_Bold_ttf, 100);
		lcd_text_boxed(440, 394, "CENTURY", SourceCodePro_Bold_ttf, 100);

		UTIL_LCD_DrawVLine(400, 120, 360, 0xffffff); // set partial menu draw
		UTIL_LCD_DrawRect(0, 120, 800,  360, 0xffffff);  // draw full frame of menu
		UTIL_LCD_DrawHLine(0, 240, 800, 0xffffff); // 1st 2 pos of menu
		UTIL_LCD_DrawHLine(0, 360, 800, 0xffffff); // 2nd 2 pos of menu


		wait_for_releasseTS();
		HAL_Delay(250);
		pressed = 0;
		while(pressed == 0) { asm volatile("NOP");}

		if( go_to_back2() == true) { return ; }
		DEMOS_RUN();
		SLIDE_SHOW();
		V_BALL();
		SET_CENTURY();
		slideshow_disable();
		clr_pressed();

	} // end while(1)
}
//===================================================================================================================

//===================================================================================================================

//===================================================================================================================

//===================================================================================================================

//===================================================================================================================
void clr_pressed(void) {
	pressed = 0;
	possition_x = 1111;
	possition_y = 1111;
}
//===================================================================================================================
bool go_to_back2(void) {
	if((test_pressed_point(0, 400, 360, 480)) == true)  {
		wait_for_releasseTS(); // wait for releasse TS
		LCD_ClrScr(lcd_background_color);
		HAL_Delay(100);
		return true;
	}
	return false; // doesn't choose set year
}
//===================================================================================================================
void DEMOS_RUN(void){
	if((test_pressed_point(0, 400, 120, 240)) != true)  { return ; }

	wait_for_releasseTS();
	HAL_Delay(50);
	start_demos();

	clr_pressed();
}
//===================================================================================================================
void SLIDE_SHOW(void) {
	uint8_t i;

	if((test_pressed_point(0, 400, 240, 360)) != true)  { return ; }

	wait_for_releasseTS(); // wait for releasse TS


	LCD_ClrScr(lcd_background_color);
	(void) BSP_LCD_SetBrightness(0,  100);

	for( i=0; i<13; i++) {



		readPicFromFlash(i);
		pressed = 0;
		while(pressed == 0) { asm volatile ("NOP");}
		wait_for_releasseTS(); // wait for releasse TS
	}

	for(int t = 100; t > -1; t--) {
		(void) BSP_LCD_SetBrightness(0, (uint32_t) t);
		HAL_Delay(50);
	}
	wait_for_releasseTS(); // wait for releasse TS
	LCD_ClrScr(lcd_background_color);
	check_night_mode();
	clr_pressed();
}
//===================================================================================================================

